; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s0)
	(at driver4 s0)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s2)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s0)
	(at package2 s1)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 64)
	(= (time-to-drive s1 s0) 64)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 68)
	(= (time-to-drive s2 s0) 68)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 56)
	(= (time-to-drive s1 s2) 56)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s0)
	(at truck2 s0)
	(at truck3 s2)
	(at truck5 s0)
	(at package2 s0)
	(at package3 s0)
	(at package4 s1)
	(at package5 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver3 s0 p0-1)
   deleted: (at driver3 s0)
   added: (at driver3 p0-1)
   goals met: 2 of 10
2. (walk driver3 p0-1 s1)
   deleted: (at driver3 p0-1)
   added: (at driver3 s1)
   goals met: 3 of 10
3. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   goals met: 3 of 10
4. (load-truck package3 truck4 s2)
   deleted: (at package3 s2)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 3 of 10
5. (load-truck package5 truck4 s2)
   deleted: (at package5 s2)
   added: (in package5 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 3 of 10
6. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   goals met: 4 of 10
7. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 3 of 10
8. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 10
9. (load-truck package2 truck2 s1)
   deleted: (at package2 s1)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 10
10. (drive-truck truck2 s1 s0 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 704
   goals met: 3 of 10
11. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 4 of 10
12. (drive-truck truck2 s0 s1 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 704 to 1344
   goals met: 3 of 10
13. (drive-truck truck4 s2 s0 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   changed: (fuel-used) from 1344 to 2228
   goals met: 3 of 10
14. (unload-truck package3 truck4 s0)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 4 of 10
15. (drive-truck truck4 s0 s2 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 2228 to 2976
   goals met: 4 of 10
16. (disembark-truck driver3 truck2 s1)
   deleted: (driving driver3 truck2)
   added: (at driver3 s1) (empty truck2)
   goals met: 5 of 10
17. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 10
18. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 2976 to 3536
   goals met: 5 of 10
19. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 6 of 10
20. (walk driver1 s2 p2-1)
   deleted: (at driver1 s2)
   added: (at driver1 p2-1)
   goals met: 6 of 10
21. (walk driver1 p2-1 s1)
   deleted: (at driver1 p2-1)
   added: (at driver1 s1)
   goals met: 6 of 10
22. (unload-truck package5 truck4 s2)
   deleted: (in package5 truck4)
   added: (at package5 s2)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 6 of 10
23. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 10
24. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 3536 to 4176
   goals met: 7 of 10
25. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 4176 to 4736
   goals met: 6 of 10
26. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 7 of 10
27. (board-truck driver3 truck5 s1)
   deleted: (at driver3 s1) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 10
28. (drive-truck truck5 s1 s2 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 4736 to 5296
   goals met: 6 of 10
29. (load-truck package5 truck5 s2)
   deleted: (at package5 s2)
   added: (in package5 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 6 of 10
30. (drive-truck truck5 s2 s0 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 5296 to 6044
   goals met: 7 of 10
31. (walk driver2 s2 p2-1)
   deleted: (at driver2 s2)
   added: (at driver2 p2-1)
   goals met: 6 of 10
32. (drive-truck truck5 s0 s1 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 6044 to 6748
   goals met: 5 of 10
33. (disembark-truck driver3 truck5 s1)
   deleted: (driving driver3 truck5)
   added: (at driver3 s1) (empty truck5)
   goals met: 6 of 10
34. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 10
35. (walk driver2 p2-1 s1)
   deleted: (at driver2 p2-1)
   added: (at driver2 s1)
   goals met: 5 of 10
36. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 5 of 10
37. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 6748 to 7364
   goals met: 5 of 10
38. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 6 of 10
39. (unload-truck package5 truck5 s2)
   deleted: (in package5 truck5)
   added: (at package5 s2)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 6 of 10
40. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 7 of 10
41. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 7364 to 8004
   goals met: 6 of 10
42. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 5 of 10
43. (load-truck package5 truck4 s2)
   deleted: (at package5 s2)
   added: (in package5 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 5 of 10
44. (board-truck driver2 truck4 s2)
   deleted: (at driver2 s2) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 10
45. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 8004 to 8644
   goals met: 5 of 10
46. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 8644 to 9204
   goals met: 6 of 10
47. (drive-truck truck4 s2 s1 driver2)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   changed: (fuel-used) from 9204 to 9820
   goals met: 6 of 10
48. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 6 of 10
49. (drive-truck truck4 s1 s2 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   changed: (fuel-used) from 9820 to 10436
   goals met: 6 of 10
50. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 6 of 10
51. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 7 of 10
52. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 6 of 10
53. (unload-truck package5 truck4 s2)
   deleted: (in package5 truck4)
   added: (at package5 s2)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 6 of 10
54. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 10436 to 11116
   goals met: 7 of 10
55. (drive-truck truck2 s0 s1 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 11116 to 11756
   goals met: 6 of 10
56. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 7 of 10
57. (drive-truck truck5 s0 s2 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (fuel-used) from 11756 to 12436
   goals met: 6 of 10
58. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 7 of 10
59. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 10
60. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 10
61. (drive-truck truck3 s2 s1 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (fuel-used) from 12436 to 13052
   goals met: 5 of 10
62. (unload-truck package5 truck3 s1)
   deleted: (in package5 truck3)
   added: (at package5 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 10
63. (walk driver4 s0 p0-2)
   deleted: (at driver4 s0)
   added: (at driver4 p0-2)
   goals met: 5 of 10
64. (drive-truck truck2 s1 s0 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 13052 to 13692
   goals met: 6 of 10
65. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 13692 to 14252
   goals met: 7 of 10
66. (walk driver4 p0-2 s2)
   deleted: (at driver4 p0-2)
   added: (at driver4 s2)
   goals met: 7 of 10
67. (board-truck driver4 truck5 s2)
   deleted: (at driver4 s2) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 7 of 10
68. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 8 of 10
69. (drive-truck truck5 s2 s0 driver4)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 14252 to 14932
   goals met: 9 of 10
70. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 10 of 10
